; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob88) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate12)
	(at pallet1 distributor0)
	(clear crate7)
	(at pallet2 distributor1)
	(clear crate10)
	(at truck0 distributor1)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 455)
	(at truck1 depot0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 304)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 depot0)
	(on crate0 pallet0)
	(= (weight crate0) 64)
	(at crate1 distributor0)
	(on crate1 pallet1)
	(= (weight crate1) 87)
	(at crate2 depot0)
	(on crate2 crate0)
	(= (weight crate2) 6)
	(at crate3 depot0)
	(on crate3 crate2)
	(= (weight crate3) 11)
	(at crate4 depot0)
	(on crate4 crate3)
	(= (weight crate4) 35)
	(at crate5 depot0)
	(on crate5 crate4)
	(= (weight crate5) 22)
	(at crate6 distributor1)
	(on crate6 pallet2)
	(= (weight crate6) 63)
	(at crate7 distributor0)
	(on crate7 crate1)
	(= (weight crate7) 95)
	(at crate8 distributor1)
	(on crate8 crate6)
	(= (weight crate8) 88)
	(at crate9 depot0)
	(on crate9 crate5)
	(= (weight crate9) 68)
	(at crate10 distributor1)
	(on crate10 crate8)
	(= (weight crate10) 26)
	(at crate11 depot0)
	(on crate11 crate9)
	(= (weight crate11) 6)
	(at crate12 depot0)
	(on crate12 crate11)
	(= (weight crate12) 10)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate10)
		(on crate1 crate2)
		(on crate2 pallet0)
		(on crate3 crate4)
		(on crate4 crate0)
		(on crate9 pallet1)
		(on crate10 crate11)
		(on crate11 pallet2)
		(on crate12 crate9)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist2 crate10 crate8 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist2) (on crate10 crate8)
   added: (lifting hoist2 crate10) (clear crate8)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 9
2. (load hoist2 crate10 truck0 distributor1)
   deleted: (lifting hoist2 crate10)
   added: (in crate10 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 26
   goals met: 0 of 9
3. (lift hoist2 crate8 crate6 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist2) (on crate8 crate6)
   added: (lifting hoist2 crate8) (clear crate6)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 9
4. (load hoist2 crate8 truck0 distributor1)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck0) (available hoist2)
   changed: (current_load truck0) from 26 to 114
   goals met: 0 of 9
5. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 2 to 12
   goals met: 0 of 9
6. (lift hoist0 crate12 crate11 depot0)
   deleted: (at crate12 depot0) (clear crate12) (available hoist0) (on crate12 crate11)
   added: (lifting hoist0 crate12) (clear crate11)
   changed: (fuel-cost) from 12 to 13
   goals met: 0 of 9
7. (load hoist0 crate12 truck1 depot0)
   deleted: (lifting hoist0 crate12)
   added: (in crate12 truck1) (available hoist0)
   changed: (current_load truck1) from 0 to 10
   goals met: 0 of 9
8. (unload hoist0 crate10 truck0 depot0)
   deleted: (in crate10 truck0) (available hoist0)
   added: (lifting hoist0 crate10)
   changed: (current_load truck0) from 114 to 88
   goals met: 0 of 9
9. (lift hoist1 crate7 crate1 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate1)
   added: (lifting hoist1 crate7) (clear crate1)
   changed: (fuel-cost) from 13 to 14
   goals met: 0 of 9
10. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 14 to 24
   goals met: 0 of 9
11. (load hoist1 crate7 truck0 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck0) (available hoist1)
   changed: (current_load truck0) from 88 to 183
   goals met: 0 of 9
12. (lift hoist1 crate1 pallet1 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   changed: (fuel-cost) from 24 to 25
   goals met: 0 of 9
13. (load hoist1 crate1 truck0 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   changed: (current_load truck0) from 183 to 270
   goals met: 0 of 9
14. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 25 to 35
   goals met: 0 of 9
15. (lift hoist2 crate6 pallet2 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist2) (on crate6 pallet2)
   added: (lifting hoist2 crate6) (clear pallet2)
   changed: (fuel-cost) from 35 to 36
   goals met: 0 of 9
16. (load hoist2 crate6 truck0 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck0) (available hoist2)
   changed: (current_load truck0) from 270 to 333
   goals met: 0 of 9
17. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 36 to 46
   goals met: 0 of 9
18. (load hoist0 crate10 truck1 depot0)
   deleted: (lifting hoist0 crate10)
   added: (in crate10 truck1) (available hoist0)
   changed: (current_load truck1) from 10 to 36
   goals met: 0 of 9
19. (lift hoist0 crate11 crate9 depot0)
   deleted: (at crate11 depot0) (clear crate11) (available hoist0) (on crate11 crate9)
   added: (lifting hoist0 crate11) (clear crate9)
   changed: (fuel-cost) from 46 to 47
   goals met: 0 of 9
20. (load hoist0 crate11 truck1 depot0)
   deleted: (lifting hoist0 crate11)
   added: (in crate11 truck1) (available hoist0)
   changed: (current_load truck1) from 36 to 42
   goals met: 0 of 9
21. (unload hoist0 crate12 truck1 depot0)
   deleted: (in crate12 truck1) (available hoist0)
   added: (lifting hoist0 crate12)
   changed: (current_load truck1) from 42 to 32
   goals met: 0 of 9
22. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 47 to 57
   goals met: 0 of 9
23. (unload hoist2 crate11 truck1 distributor1)
   deleted: (in crate11 truck1) (available hoist2)
   added: (lifting hoist2 crate11)
   changed: (current_load truck1) from 32 to 26
   goals met: 0 of 9
24. (drop hoist2 crate11 pallet2 distributor1)
   deleted: (lifting hoist2 crate11) (clear pallet2)
   added: (available hoist2) (at crate11 distributor1) (clear crate11) (on crate11 pallet2)
   goals met: 1 of 9
25. (load hoist0 crate12 truck0 depot0)
   deleted: (lifting hoist0 crate12)
   added: (in crate12 truck0) (available hoist0)
   changed: (current_load truck0) from 333 to 343
   goals met: 1 of 9
26. (lift hoist0 crate9 crate5 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist0) (on crate9 crate5)
   added: (lifting hoist0 crate9) (clear crate5)
   changed: (fuel-cost) from 57 to 58
   goals met: 1 of 9
27. (load hoist0 crate9 truck0 depot0)
   deleted: (lifting hoist0 crate9)
   added: (in crate9 truck0) (available hoist0)
   changed: (current_load truck0) from 343 to 411
   goals met: 1 of 9
28. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 58 to 68
   goals met: 1 of 9
29. (unload hoist1 crate9 truck0 distributor0)
   deleted: (in crate9 truck0) (available hoist1)
   added: (lifting hoist1 crate9)
   changed: (current_load truck0) from 411 to 343
   goals met: 1 of 9
30. (drop hoist1 crate9 pallet1 distributor0)
   deleted: (lifting hoist1 crate9) (clear pallet1)
   added: (available hoist1) (at crate9 distributor0) (clear crate9) (on crate9 pallet1)
   goals met: 2 of 9
31. (unload hoist1 crate12 truck0 distributor0)
   deleted: (in crate12 truck0) (available hoist1)
   added: (lifting hoist1 crate12)
   changed: (current_load truck0) from 343 to 333
   goals met: 2 of 9
32. (drop hoist1 crate12 crate9 distributor0)
   deleted: (lifting hoist1 crate12) (clear crate9)
   added: (available hoist1) (at crate12 distributor0) (clear crate12) (on crate12 crate9)
   goals met: 3 of 9
33. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 68 to 78
   goals met: 3 of 9
34. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 78 to 88
   goals met: 3 of 9
35. (lift hoist0 crate5 crate4 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist0) (on crate5 crate4)
   added: (lifting hoist0 crate5) (clear crate4)
   changed: (fuel-cost) from 88 to 89
   goals met: 3 of 9
36. (load hoist0 crate5 truck1 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck1) (available hoist0)
   changed: (current_load truck1) from 26 to 48
   goals met: 3 of 9
37. (lift hoist0 crate4 crate3 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate3)
   added: (lifting hoist0 crate4) (clear crate3)
   changed: (fuel-cost) from 89 to 90
   goals met: 3 of 9
38. (load hoist0 crate4 truck1 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck1) (available hoist0)
   changed: (current_load truck1) from 48 to 83
   goals met: 3 of 9
39. (lift hoist0 crate3 crate2 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 crate2)
   added: (lifting hoist0 crate3) (clear crate2)
   changed: (fuel-cost) from 90 to 91
   goals met: 3 of 9
40. (load hoist0 crate3 truck1 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck1) (available hoist0)
   changed: (current_load truck1) from 83 to 94
   goals met: 3 of 9
41. (unload hoist0 crate1 truck0 depot0)
   deleted: (in crate1 truck0) (available hoist0)
   added: (lifting hoist0 crate1)
   changed: (current_load truck0) from 333 to 246
   goals met: 3 of 9
42. (drop hoist0 crate1 crate2 depot0)
   deleted: (lifting hoist0 crate1) (clear crate2)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 crate2)
   goals met: 4 of 9
43. (unload hoist0 crate4 truck1 depot0)
   deleted: (in crate4 truck1) (available hoist0)
   added: (lifting hoist0 crate4)
   changed: (current_load truck1) from 94 to 59
   goals met: 4 of 9
44. (drop hoist0 crate4 crate1 depot0)
   deleted: (lifting hoist0 crate4) (clear crate1)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate1)
   goals met: 4 of 9
45. (lift hoist0 crate4 crate1 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate1)
   added: (lifting hoist0 crate4) (clear crate1)
   changed: (fuel-cost) from 91 to 92
   goals met: 4 of 9
46. (load hoist0 crate4 truck1 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck1) (available hoist0)
   changed: (current_load truck1) from 59 to 94
   goals met: 4 of 9
47. (lift hoist0 crate1 crate2 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 crate2)
   added: (lifting hoist0 crate1) (clear crate2)
   changed: (fuel-cost) from 92 to 93
   goals met: 3 of 9
48. (load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   changed: (current_load truck1) from 94 to 181
   goals met: 3 of 9
49. (lift hoist0 crate2 crate0 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 crate0)
   added: (lifting hoist0 crate2) (clear crate0)
   changed: (fuel-cost) from 93 to 94
   goals met: 3 of 9
50. (load hoist0 crate2 truck0 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck0) (available hoist0)
   changed: (current_load truck0) from 246 to 252
   goals met: 3 of 9
51. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet0)
   added: (lifting hoist0 crate0) (clear pallet0)
   changed: (fuel-cost) from 94 to 95
   goals met: 3 of 9
52. (load hoist0 crate0 truck1 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck1) (available hoist0)
   changed: (current_load truck1) from 181 to 245
   goals met: 3 of 9
53. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 95 to 105
   goals met: 3 of 9
54. (unload hoist2 crate10 truck1 distributor1)
   deleted: (in crate10 truck1) (available hoist2)
   added: (lifting hoist2 crate10)
   changed: (current_load truck1) from 245 to 219
   goals met: 3 of 9
55. (drop hoist2 crate10 crate11 distributor1)
   deleted: (lifting hoist2 crate10) (clear crate11)
   added: (available hoist2) (at crate10 distributor1) (clear crate10) (on crate10 crate11)
   goals met: 4 of 9
56. (unload hoist0 crate2 truck0 depot0)
   deleted: (in crate2 truck0) (available hoist0)
   added: (lifting hoist0 crate2)
   changed: (current_load truck0) from 252 to 246
   goals met: 4 of 9
57. (drop hoist0 crate2 pallet0 depot0)
   deleted: (lifting hoist0 crate2) (clear pallet0)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 pallet0)
   goals met: 5 of 9
58. (unload hoist2 crate0 truck1 distributor1)
   deleted: (in crate0 truck1) (available hoist2)
   added: (lifting hoist2 crate0)
   changed: (current_load truck1) from 219 to 155
   goals met: 5 of 9
59. (drop hoist2 crate0 crate10 distributor1)
   deleted: (lifting hoist2 crate0) (clear crate10)
   added: (available hoist2) (at crate0 distributor1) (clear crate0) (on crate0 crate10)
   goals met: 6 of 9
60. (unload hoist2 crate4 truck1 distributor1)
   deleted: (in crate4 truck1) (available hoist2)
   added: (lifting hoist2 crate4)
   changed: (current_load truck1) from 155 to 120
   goals met: 6 of 9
61. (drop hoist2 crate4 crate0 distributor1)
   deleted: (lifting hoist2 crate4) (clear crate0)
   added: (available hoist2) (at crate4 distributor1) (clear crate4) (on crate4 crate0)
   goals met: 7 of 9
62. (unload hoist2 crate3 truck1 distributor1)
   deleted: (in crate3 truck1) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck1) from 120 to 109
   goals met: 7 of 9
63. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 105 to 115
   goals met: 7 of 9
64. (unload hoist0 crate1 truck1 depot0)
   deleted: (in crate1 truck1) (available hoist0)
   added: (lifting hoist0 crate1)
   changed: (current_load truck1) from 109 to 22
   goals met: 7 of 9
65. (drop hoist0 crate1 crate2 depot0)
   deleted: (lifting hoist0 crate1) (clear crate2)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 crate2)
   goals met: 8 of 9
66. (drop hoist2 crate3 crate4 distributor1)
   deleted: (lifting hoist2 crate3) (clear crate4)
   added: (available hoist2) (at crate3 distributor1) (clear crate3) (on crate3 crate4)
   goals met: 9 of 9
